app/controllers/epicenter_controller.rb

  def feed
    @following_tweets = []

    Tweet.all.each do |tweet|
---
SELECT "tweets".* FROM "tweets"

  def show_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def now_following
  current_user.following.push(params[:id].to_i)
  current_user.save
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 1\n"], ["updated_at", "2018-09-11 14:06:46.833462"], ["id", 2]]